lib/gcf/script.yml
---
  # Thank you for trying serverless-artillery!
  # This default script is intended to get you started quickly.
  # There is a lot more that Artillery can do.
  # You can find great documentation of the possibilities at:
  # https://artillery.io/docs/
  _trace: true
  config:
    target: "https://cloud.google.com" # this hostname will be used for each part of the flow
    phases:
      - duration: 5 # in seconds
        arrivalRate: 1 # 1 requests per second
  scenarios:
    -
      flow:
        -
          get:
            url: "/"