lib/gcf/script.yml
---
  # Thank you for trying serverless-artillery!
  # This default script is intended to get you started quickly.
  # There is a lot more that Artillery can do.
  # You can find great documentation of the possibilities at:
  # https://artillery.io/docs/
  _trace: true
  _split:
    maxChunkDurationInSeconds: 15
    maxChunkRequestsPerSecond: 1
  config:
    plugins:
      cloudwatch:
        namespace : loadGenerator
    target: "https://us-central1-vikj-61740.cloudfunctions.net/helloGET2" # this hostname will be used for each part of the flow
    phases:
      - duration: 20
        arrivalRate: 2
#      - duration: 240
#        arrivalRate: 50
#        rampTo: 500
#      - duration: 600
#        arrivalRate: 500
  scenarios:
    -
      flow:
        -
          get:
            url: "/"