lib/gcf/script.yml
---
  # Thank you for trying serverless-artillery!
  # This default script is intended to get you started quickly.
  # There is a lot more that Artillery can do.
  # You can find great documentation of the possibilities at:
  # https://artillery.io/docs/
  _trace: true
  _split:
#    maxChunkDurationInSeconds: 20
    maxChunkRequestsPerSecond: 10
  config:
    plugins:
      cloudwatch:
        namespace : loadGenerator
    target: "https://us-central1-vikj-61740.cloudfunctions.net/helloGET2" # this hostname will be used for each part of the flow
    phases:
#      - duration: 900
#        arrivalRate: 50
      - duration: 240
        arrivalRate: 50
        rampTo: 500
      - duration:

        arrivalRate: 500
  scenarios:
    -
      flow:
        -
          get:
            url: "/"